Revit 2027 API
ElectricalSystem.Length Property
 The Length value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
public:
property double Length {
	double get ();
}
member Length : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the length cannot be computed, because it is zero, or because the circuit is not connected to a panel.
Remarks
 This property is used to retrieve the Length value of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace